# #+LATEX_CLASS: article
# #+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}

#+TITLE: Machine Learning -- Week 1
#+AUTHOR: Claudio Parra
#+OPTIONS: toc:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />

[[file:week1_notes.org][.]] [[file:week2_notes.org][Week 2]]

** Dimensions
#+begin_src octave
% The ; inside of the matrix denotes we are
% going back to a new row.
A = [1, 2, 3; 4, 5, 6; 7, 8, 9; 10, 11, 12]
[rows,cols] = size(A);
rows,cols
A_23 = A(2,3)
%
% Initialize a vector
v = [1;2;3]
[rows,cols] = size(v)
rows,cols
v_3  = v(3)
#+end_src

#+RESULTS:
#+begin_example
A =

    1    2    3
    4    5    6
    7    8    9
   10   11   12
rows = 4
cols = 3
A_23 = 6
v =

   1
   2
   3
rows = 3
cols = 1
rows = 3
cols = 1
v_3 = 3
#+end_example


** Scalar Operations
#+begin_src octave
% Initialize matrix A and B, and scalar s
A = [1, 2, 4; 5, 3, 2]
B = [1, 3, 4; 1, 1, 1]
s = 2
add_AB = A + B
sub_AB = A - B
mult_As = A * s
div_As = A / s
add_As = A + s
#+end_src

#+RESULTS:
#+begin_example
A =

   1   2   4
   5   3   2
B =

   1   3   4
   1   1   1
s = 2
add_AB =

   2   5   8
   6   4   3
sub_AB =

   0  -1   0
   4   2   1
mult_As =

    2    4    8
   10    6    4
div_As =

   0.5000   1.0000   2.0000
   2.5000   1.5000   1.0000
add_As =

   3   4   6
   7   5   4
#+end_example

** Matrix Vector Multiplitation
- I find it easier to see the operation if I dispose the operands using this layout:
  #+begin_example
                 B=
              |  x
        nxn   |  y
      square  |  z
      --------+----
      1  2  3 | [*]  <---- 1x + 2y + 3z
  A=  4  5  6 | [ ]
      7  8  9 | [ ]
      A  B  C | [ ]
  #+end_example

  #+begin_src octave
  % Initialize matrix A and vector v
  A = [1, 2, 3; 4, 5, 6;7, 8, 9]
  v = [1; 2; 1]
  Av = A * v
  #+end_src

  #+RESULTS:
  #+begin_example
  A =

     1   2   3
     4   5   6
     7   8   9
  v =

     1
     2
     1
  Av =

      8
     20
     32
  #+end_example

#+RESULTS:
*** Inverse
- If \(A\) is a square matrix of size \(m \times m\), and it has an inverse, then
  \[A \times A^{-1} = A^{-1} \times A = I\]
  #+begin_src octave
  A = [3 4; 2 16]
  %
  Ainv_numeric = pinv(A)
  A * Ainv_numeric
  % If you pay attention, the product generates tiny rounding errors.
  %
  Ainv_exact = [0.4 -0.1; -0.05 0.075]
  A * Ainv_exact
  % This is the precise answer.
  #+end_src

  #+RESULTS:
  #+begin_example
  A =

      3    4
      2   16
  Ainv_numeric =

     0.400000  -0.100000
    -0.050000   0.075000
  ans =

     1.0000e+00   1.1102e-16
    -2.2204e-16   1.0000e+00
  Ainv_exact =

     0.400000  -0.100000
    -0.050000   0.075000
  ans =

     1.0000  -0.0000
          0   1.0000
  #+end_example

- A matrix without inverse is said to be *Singular* or *Degenerate*
*** Transpose
- The transpose of a matrix \(A\) is denoted by \(A^{T}\).
- In octave, it is experssed with an apostrophe.
  #+begin_src octave
  A = [1 2 3 4; 5 6 7 8]
  At = A'
  #+end_src

  #+RESULTS:
  #+begin_example
  A =

     1   2   3   4
     5   6   7   8
  At =

     1   5
     2   6
     3   7
     4   8
  #+end_example


